--- actor-scheduler/src/lib.rs
+++ replace backoff_with_jitter -> Result<Duration, SendError> with Ok(Default::default())
@@ -618,39 +618,17 @@
 /// Fibonacci hash constant for jitter calculation.
 const JITTER_HASH_CONSTANT: u64 = 0x9e3779b97f4a7c15;

 /// Calculate exponential backoff with jitter.
 ///
 /// Uses a simple exponential backoff strategy with added jitter to prevent
 /// thundering herd problems when multiple actors wake simultaneously.
 fn backoff_with_jitter(attempt: u32, params: &SchedulerParams) -> Result<Duration, SendError> {
-    let base_micros = params.min_backoff.as_micros() as u64;
-    let max_micros = params.max_backoff.as_micros() as u64;
-
-    let multiplier = 2u64.saturating_pow(attempt);
-    let backoff_micros = base_micros.saturating_mul(multiplier);
-    if backoff_micros > max_micros {
-        return Err(SendError::Timeout);
-    }
-
-    // Add jitter: random value between [min_pct%, (min_pct+range_pct)%] of backoff
-    // Use wall clock time for actual randomness (prevents thundering herd)
-    let now = std::time::SystemTime::now()
-        .duration_since(std::time::UNIX_EPOCH)
-        .unwrap_or(Duration::from_secs(0));
-
-    // Mix nanoseconds with attempt number for better distribution across threads
-    let hash = (now.as_nanos() as u64 ^ (attempt as u64).wrapping_mul(0x517cc1b727220a95))
-        .wrapping_mul(JITTER_HASH_CONSTANT);
-
-    let jitter_pct = params.jitter_min_pct + (hash % params.jitter_range_pct);
-    let jittered_micros = (backoff_micros * jitter_pct) / 100;
-
-    Ok(Duration::from_micros(jittered_micros))
+    Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
 }

 /// System messages - combines wake and shutdown into one channel
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 enum System {
     /// Wake the scheduler to process messages
     Wake,
     /// Shutdown the scheduler
