--- actor-scheduler/src/lib.rs
+++ replace * with / in backoff_with_jitter
@@ -638,17 +638,17 @@
         .duration_since(std::time::UNIX_EPOCH)
         .unwrap_or(Duration::from_secs(0));

     // Mix nanoseconds with attempt number for better distribution across threads
     let hash = (now.as_nanos() as u64 ^ (attempt as u64).wrapping_mul(0x517cc1b727220a95))
         .wrapping_mul(JITTER_HASH_CONSTANT);

     let jitter_pct = params.jitter_min_pct + (hash % params.jitter_range_pct);
-    let jittered_micros = (backoff_micros * jitter_pct) / 100;
+    let jittered_micros = (backoff_micros / /* ~ changed by cargo-mutants ~ */ jitter_pct) / 100;

     Ok(Duration::from_micros(jittered_micros))
 }

 /// System messages - combines wake and shutdown into one channel
 #[derive(Debug, Clone, Copy, PartialEq, Eq)]
 enum System {
     /// Wake the scheduler to process messages
