--- actor-scheduler/src/lib.rs
+++ replace <impl std::fmt::Debug for ActorHandle<D, C, M>>::fmt -> std::fmt::Result with Ok(Default::default())
@@ -673,19 +673,17 @@
     wake_handler: Option<Arc<dyn WakeHandler>>,
     // Tunable parameters for backoff/retry behavior
     params: SchedulerParams,
 }

 // Manual Debug implementation - wake_handler is opaque (trait object)
 impl<D, C, M> std::fmt::Debug for ActorHandle<D, C, M> {
     fn fmt(&self, f: &mut std::fmt::Formatter<'_>) -> std::fmt::Result {
-        f.debug_struct("ActorHandle")
-            .field("has_wake_handler", &self.wake_handler.is_some())
-            .finish_non_exhaustive()
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 }

 /// Send with retry and exponential backoff + jitter for fairness.
 ///
 /// Backoff strategy:
 /// 1. Spin (immediate retry) for first `params.spin_attempts`
 /// 2. Yield (cooperative) for next `params.yield_attempts`
