--- actor-scheduler/src/lib.rs
+++ replace ActorScheduler<D, C, M>::drain_all_with_timeout -> Result<(), HandlerError> with Ok(())
@@ -879,52 +879,17 @@
     fn drain_all_with_timeout<A>(
         &mut self,
         actor: &mut A,
         timeout: std::time::Duration,
     ) -> Result<(), HandlerError>
     where
         A: Actor<D, C, M>,
     {
-        use std::time::Instant;
-
-        let deadline = Instant::now() + timeout;
-        let batch_size = 10;
-
-        loop {
-            let control_status = self
-                .rx_control
-                .drain(batch_size, |msg| actor.handle_control(msg))?;
-            if Instant::now() >= deadline {
-                return Ok(());
-            }
-
-            let mgmt_status = self
-                .rx_mgmt
-                .drain(batch_size, |msg| actor.handle_management(msg))?;
-            if Instant::now() >= deadline {
-                return Ok(());
-            }
-
-            let data_status = self
-                .rx_data
-                .drain(batch_size, |msg| actor.handle_data(msg))?;
-            if Instant::now() >= deadline {
-                return Ok(());
-            }
-
-            // Done when all channels are empty or disconnected
-            let all_done = !matches!(control_status, DrainStatus::More)
-                && !matches!(mgmt_status, DrainStatus::More)
-                && !matches!(data_status, DrainStatus::More);
-
-            if all_done {
-                return Ok(());
-            }
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }

     /// Process messages from all priority lanes, return status.
     ///
     /// Returns:
     /// - `Ok(Some(status))` - Processed messages, continue with given status
     /// - `Ok(None)` - All channels disconnected, normal shutdown
     /// - `Err(HandlerError)` - Handler failed
