--- actor-scheduler/src/lib.rs
+++ replace + with * in ActorScheduler<D, C, M>::drain_all_with_timeout
@@ -881,17 +881,17 @@
         actor: &mut A,
         timeout: std::time::Duration,
     ) -> Result<(), HandlerError>
     where
         A: Actor<D, C, M>,
     {
         use std::time::Instant;

-        let deadline = Instant::now() + timeout;
+        let deadline = Instant::now() * /* ~ changed by cargo-mutants ~ */ timeout;
         let batch_size = 10;

         loop {
             let control_status = self
                 .rx_control
                 .drain(batch_size, |msg| actor.handle_control(msg))?;
             if Instant::now() >= deadline {
                 return Ok(());
