--- actor-scheduler/src/lib.rs
+++ replace >= with < in ActorScheduler<D, C, M>::drain_all_with_timeout
@@ -902,17 +902,17 @@
                 .drain(batch_size, |msg| actor.handle_management(msg))?;
             if Instant::now() >= deadline {
                 return Ok(());
             }

             let data_status = self
                 .rx_data
                 .drain(batch_size, |msg| actor.handle_data(msg))?;
-            if Instant::now() >= deadline {
+            if Instant::now() < /* ~ changed by cargo-mutants ~ */ deadline {
                 return Ok(());
             }

             // Done when all channels are empty or disconnected
             let all_done = !matches!(control_status, DrainStatus::More)
                 && !matches!(mgmt_status, DrainStatus::More)
                 && !matches!(data_status, DrainStatus::More);
