*** pixelflow-core/src/combinators/select.rs:105:9: replace <impl FieldCondition<Field4> for Gt<L, R>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<Field4> for Gt<L, R>>::eval_mask -> NativeMask with Default::default()
@@ -97,19 +97,17 @@

 impl<L, R> FieldCondition<Field4> for Gt<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: Field4) -> NativeMask {
-        let left = self.0.eval(p);
-        let right = self.1.eval(p);
-        left.0.cmp_gt(right.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 impl<L, R> FieldCondition<Field4> for Le<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {

---- select_tests::select_should_choose_based_on_condition stdout ----

thread 'select_tests::select_should_choose_based_on_condition' (13358) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 10
Actual (lanes): [20.0, 20.0, 20.0, 20.0, 20.0, 20.0, 20.0, 20.0]

failures:
    select_tests::select_should_choose_based_on_condition

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
