*** pixelflow-core/src/combinators/select.rs:118:9: replace <impl FieldCondition<Field4> for Le<L, R>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<Field4> for Le<L, R>>::eval_mask -> NativeMask with Default::default()
@@ -110,19 +110,17 @@

 impl<L, R> FieldCondition<Field4> for Le<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: Field4) -> NativeMask {
-        let left = self.0.eval(p);
-        let right = self.1.eval(p);
-        left.0.cmp_le(right.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 impl<L, R> FieldCondition<Field4> for Ge<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {

---- select_tests::select_comparisons_should_respect_equality_boundary stdout ----

thread 'select_tests::select_comparisons_should_respect_equality_boundary' (13761) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 1
Actual (lanes): [2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0]

failures:
    select_tests::select_comparisons_should_respect_equality_boundary

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
