*** pixelflow-core/src/combinators/select.rs:131:9: replace <impl FieldCondition<Field4> for Ge<L, R>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<Field4> for Ge<L, R>>::eval_mask -> NativeMask with Default::default()
@@ -123,19 +123,17 @@

 impl<L, R> FieldCondition<Field4> for Ge<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: Field4) -> NativeMask {
-        let left = self.0.eval(p);
-        let right = self.1.eval(p);
-        left.0.cmp_ge(right.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 // ============================================================================
 // FieldCondition for boolean combinations
 // ============================================================================

 impl<L, R, P> FieldCondition<P> for And<L, R>

---- select_tests::select_comparisons_should_respect_equality_boundary stdout ----

thread 'select_tests::select_comparisons_should_respect_equality_boundary' (14164) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 1
Actual (lanes): [2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0]

---- select_tests::select_should_short_circuit_false_branch stdout ----

thread 'select_tests::select_should_short_circuit_false_branch' (14167) panicked at pixelflow-core/tests/unit_tests.rs:298:13:
Manifold evaluated when it should have been short-circuited!

failures:
    select_tests::select_comparisons_should_respect_equality_boundary
    select_tests::select_should_short_circuit_false_branch

test result: FAILED. 27 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
