*** pixelflow-core/src/combinators/select.rs:149:9: replace <impl FieldCondition<P> for And<L, R>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<P> for And<L, R>>::eval_mask -> NativeMask with Default::default()
@@ -141,17 +141,17 @@
 impl<L, R, P> FieldCondition<P> for And<L, R>
 where
     P: Copy,
     L: FieldCondition<P>,
     R: FieldCondition<P>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: P) -> NativeMask {
-        self.0.eval_mask(p) & self.1.eval_mask(p)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 impl<L, R, P> FieldCondition<P> for Or<L, R>
 where
     P: Copy,
     L: FieldCondition<P>,
     R: FieldCondition<P>,

*** result: Success
