*** pixelflow-core/src/combinators/select.rs:172:9: delete ! in <impl FieldCondition<P> for BNot<T>>::eval_mask

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ delete ! in <impl FieldCondition<P> for BNot<T>>::eval_mask
@@ -164,17 +164,17 @@

 impl<T, P> FieldCondition<P> for BNot<T>
 where
     P: Copy,
     T: FieldCondition<P>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: P) -> NativeMask {
-        !self.0.eval_mask(p)
+         /* ~ changed by cargo-mutants ~ */self.0.eval_mask(p)
     }
 }

 // ============================================================================
 // FieldCondition for Abs<T> (common in threshold patterns like |winding| >= 0.5)
 // ============================================================================

 impl<T> FieldCondition<Field4> for crate::ops::unary::Abs<T>

---- bnot_tests::bnot_should_invert_logic stdout ----

thread 'bnot_tests::bnot_should_invert_logic' (16722) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 1
Actual (lanes): [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]

failures:
    bnot_tests::bnot_should_invert_logic

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
