*** pixelflow-core/src/combinators/select.rs:571:12: delete ! in <impl Manifold<(([T0; N], [T1; M], [T2; K]), P)> for Select<C, Tr, F>>::eval

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ delete ! in <impl Manifold<(([T0; N], [T1; M], [T2; K]), P)> for Select<C, Tr, F>>::eval
@@ -563,17 +563,17 @@
 {
     type Output = O;
     #[inline(always)]
     fn eval(&self, p: (([T0; N], [T1; M], [T2; K]), P)) -> O {
         let mask = self.cond.eval(p);
         if mask.all() {
             return self.if_true.eval(p);
         }
-        if !mask.any() {
+        if  /* ~ changed by cargo-mutants ~ */mask.any() {
             return self.if_false.eval(p);
         }
         let true_val = self.if_true.eval(p);
         let false_val = self.if_false.eval(p);
         O::select_raw(mask, true_val, false_val)
     }
 }

*** result: Success
