*** pixelflow-core/src/combinators/select.rs:92:9: replace <impl FieldCondition<Field4> for Lt<L, R>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<Field4> for Lt<L, R>>::eval_mask -> NativeMask with Default::default()
@@ -84,19 +84,17 @@

 impl<L, R> FieldCondition<Field4> for Lt<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: Field4) -> NativeMask {
-        let left = self.0.eval(p);
-        let right = self.1.eval(p);
-        left.0.cmp_lt(right.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 impl<L, R> FieldCondition<Field4> for Gt<L, R>
 where
     L: Manifold<Field4, Output = Field>,
     R: Manifold<Field4, Output = Field>,
 {

---- select_tests::select_should_blend_mixed_mask stdout ----

thread 'select_tests::select_should_blend_mixed_mask' (12952) panicked at pixelflow-core/tests/unit_tests.rs:371:9:
Lane 0 should be 10.0

failures:
    select_tests::select_should_blend_mixed_mask

test result: FAILED. 28 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
