*** pixelflow-core/src/combinators/select.rs:149:29: replace & with | in <impl FieldCondition<P> for And<L, R>>::eval_mask

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace & with | in <impl FieldCondition<P> for And<L, R>>::eval_mask
@@ -141,17 +141,17 @@
 impl<L, R, P> FieldCondition<P> for And<L, R>
 where
     P: Copy,
     L: FieldCondition<P>,
     R: FieldCondition<P>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: P) -> NativeMask {
-        self.0.eval_mask(p) & self.1.eval_mask(p)
+        self.0.eval_mask(p) | /* ~ changed by cargo-mutants ~ */ self.1.eval_mask(p)
     }
 }

 impl<L, R, P> FieldCondition<P> for Or<L, R>
 where
     P: Copy,
     L: FieldCondition<P>,
     R: FieldCondition<P>,

---- select_tests::select_logic_and_should_behave_like_and stdout ----

thread 'select_tests::select_logic_and_should_behave_like_and' (33608) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 2
Actual (lanes): [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]

failures:
    select_tests::select_logic_and_should_behave_like_and

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
