*** pixelflow-core/src/combinators/select.rs:161:29: replace | with & in <impl FieldCondition<P> for Or<L, R>>::eval_mask

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace | with & in <impl FieldCondition<P> for Or<L, R>>::eval_mask
@@ -153,17 +153,17 @@
 impl<L, R, P> FieldCondition<P> for Or<L, R>
 where
     P: Copy,
     L: FieldCondition<P>,
     R: FieldCondition<P>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: P) -> NativeMask {
-        self.0.eval_mask(p) | self.1.eval_mask(p)
+        self.0.eval_mask(p) & /* ~ changed by cargo-mutants ~ */ self.1.eval_mask(p)
     }
 }

 impl<T, P> FieldCondition<P> for BNot<T>
 where
     P: Copy,
     T: FieldCondition<P>,
 {

---- select_tests::select_logic_or_should_behave_like_or stdout ----

thread 'select_tests::select_logic_or_should_behave_like_or' (34461) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 1
Actual (lanes): [2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0, 2.0]

failures:
    select_tests::select_logic_or_should_behave_like_or

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
