*** pixelflow-core/src/combinators/select.rs:172:9: replace <impl FieldCondition<P> for BNot<T>>::eval_mask -> NativeMask with Default::default()

*** mutation diff:
--- pixelflow-core/src/combinators/select.rs
+++ replace <impl FieldCondition<P> for BNot<T>>::eval_mask -> NativeMask with Default::default()
@@ -164,17 +164,17 @@

 impl<T, P> FieldCondition<P> for BNot<T>
 where
     P: Copy,
     T: FieldCondition<P>,
 {
     #[inline(always)]
     fn eval_mask(&self, p: P) -> NativeMask {
-        !self.0.eval_mask(p)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }

 // ============================================================================
 // FieldCondition for Abs<T> (common in threshold patterns like |winding| >= 0.5)
 // ============================================================================

 impl<T> FieldCondition<Field4> for crate::ops::unary::Abs<T>

---- bnot_tests::bnot_should_invert_logic stdout ----

thread 'bnot_tests::bnot_should_invert_logic' (34875) panicked at pixelflow-core/tests/unit_tests.rs:76:9:
Field assertion failed.
Expected: approx 1
Actual (lanes): [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]

failures:
    bnot_tests::bnot_should_invert_logic

test result: FAILED. 31 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
